{
  "1": {
    "week": 1,
    "title": "Faith & Hope",
    "days": {
      "1": {
        "day_title": "Faith Is the Foundation",
        "verse_ref": "Hebrews 11:1 (NKJV)",
        "verse_text": "Now faith is the substance of things hoped for, the evidence of things not seen.",
        "reflection": "Faith doesn’t guess; it trusts the Architect before the blueprint is finished. God is already at the end, faithful at every step in between.",
        "encouragement": "Keep walking; the bridge will appear under your feet."
      },
      "2": {
        "day_title": "Hope That Endures",
        "verse_ref": "Romans 5:3–5 (NKJV)",
        "verse_text": "Tribulation produces perseverance; and perseverance, character; and character, hope.",
        "reflection": "God doesn’t waste your trials. He forges perseverance that becomes character, and character that blossoms into hope.",
        "encouragement": "You’re not stuck in the storm; you’re strengthening in it."
      },
      "3": {
        "day_title": "Faith That Works",
        "verse_ref": "James 2:17 (NKJV)",
        "verse_text": "Faith by itself, if it does not have works, is dead.",
        "reflection": "Faith is not a couch; it’s a pair of shoes. Do one small act of good today because God is good.",
        "encouragement": "Action is faith’s favorite language."
      },
      "4": {
        "day_title": "Hope as an Anchor",
        "verse_ref": "Hebrews 6:19 (NKJV)",
        "verse_text": "This hope we have as an anchor of the soul, both sure and steadfast.",
        "reflection": "When waves rise, drop anchor. Hope holds you steady while faith waits for the calm God speaks.",
        "encouragement": "Anchors don’t stop storms — they stop drift."
      },
      "5": {
        "day_title": "Faith That Lifts Others",
        "verse_ref": "Galatians 6:9 (NKJV)",
        "verse_text": "Let us not grow weary while doing good, for in due season we shall reap if we do not lose heart.",
        "reflection": "Your kindness plants seeds in fields you may never see. God’s calendar never misses harvest.",
        "encouragement": "When you lift others, heaven lifts you."
      },
      "6": {
        "day_title": "Hope in the Waiting",
        "verse_ref": "Isaiah 40:31 (NKJV)",
        "verse_text": "Those who wait on the Lord shall renew their strength… they shall mount up with wings like eagles.",
        "reflection": "Waiting is God’s workshop. Delays are shaping stronger wings for your next flight.",
        "encouragement": "Even when grounded, you’re still in flight school."
      },
      "7": {
        "day_title": "Faith & Hope United in Love",
        "verse_ref": "1 Corinthians 13:13 (NKJV)",
        "verse_text": "And now abide faith, hope, love, these three; but the greatest of these is love.",
        "reflection": "Faith and hope travel best with love. Great love in small things turns belief into joy.",
        "encouragement": "Love turns faith into action and hope into song."
      }
    }
  },
  "2": {
    "week": 2,
    "title": "Joy & Gratitude",
    "days": {
      "1": {
        "day_title": "Joy in the Lord",
        "verse_ref": "Philippians 4:4 (NKJV)",
        "verse_text": "Rejoice in the Lord always. Again I will say, rejoice!",
        "reflection": "Joy is not the absence of trouble but the presence of the Lord. Rejoicing reorients your heart to His goodness.",
        "encouragement": "Choose rejoicing; it opens the blinds to let in the light."
      },
      "2": {
        "day_title": "Gratitude as a Guard",
        "verse_ref": "Colossians 3:15 (NKJV)",
        "verse_text": "Let the peace of God rule in your hearts… and be thankful.",
        "reflection": "Thankfulness invites peace to take the referee’s whistle in your heart. Gratitude quiets grumbling and guides your steps.",
        "encouragement": "Count blessings until worry runs out of numbers."
      },
      "3": {
        "day_title": "Joy from Salvation",
        "verse_ref": "Psalm 51:12 (NKJV)",
        "verse_text": "Restore to me the joy of Your salvation…",
        "reflection": "Joy returns as we remember whose we are. Salvation joy is deeper than mood and stronger than circumstance.",
        "encouragement": "Your joy is tethered to His mercy, not your momentum."
      },
      "4": {
        "day_title": "Gratitude in Everything",
        "verse_ref": "1 Thessalonians 5:18 (NKJV)",
        "verse_text": "In everything give thanks; for this is the will of God in Christ Jesus for you.",
        "reflection": "In everything — not for everything. Gratitude in the middle of messes is an act of faith that God is still working.",
        "encouragement": "Give thanks anyway; it’s a key that fits every lock."
      },
      "5": {
        "day_title": "Strength through Joy",
        "verse_ref": "Nehemiah 8:10 (NKJV)",
        "verse_text": "The joy of the Lord is your strength.",
        "reflection": "God’s joy is not fragile. It lends backbone to weary souls and breath to tired lungs.",
        "encouragement": "Lean on joy; it won’t snap under weight."
      },
      "6": {
        "day_title": "Sing a New Song",
        "verse_ref": "Psalm 98:1 (NKJV)",
        "verse_text": "Oh, sing to the Lord a new song! For He has done marvelous things.",
        "reflection": "New songs come from fresh remembrance. Name His marvels and let your heart hum along.",
        "encouragement": "Hum gratitude; it turns into praise before you know it."
      },
      "7": {
        "day_title": "Overflowing Hope",
        "verse_ref": "Romans 15:13 (NKJV)",
        "verse_text": "Now may the God of hope fill you with all joy and peace in believing…",
        "reflection": "Joy and peace flow from trusting hearts; hope overflows when we keep believing the God of hope.",
        "encouragement": "Top off your hope tank — He’s the station that never closes."
      }
    }
  },
  "3": {
    "week": 3,
    "title": "Peace & Trust",
    "days": {
      "1": {
        "day_title": "Peace Beyond Understanding",
        "verse_ref": "Philippians 4:6–7 (NKJV)",
        "verse_text": "…the peace of God… will guard your hearts and minds through Christ Jesus.",
        "reflection": "Prayer trades anxiety for God’s watchful peace. His peace stands sentry where worries once marched.",
        "encouragement": "Pass your burdens to the One with stronger shoulders."
      },
      "2": {
        "day_title": "Trust in the Lord",
        "verse_ref": "Proverbs 3:5–6 (NKJV)",
        "verse_text": "Trust in the Lord with all your heart… and He shall direct your paths.",
        "reflection": "Trust leans, not analyzes. Acknowledge Him in each step and find your feet guided.",
        "encouragement": "Lean hard; His path holds."
      },
      "3": {
        "day_title": "Jesus, Our Peace",
        "verse_ref": "John 14:27 (NKJV)",
        "verse_text": "Peace I leave with you… not as the world gives…",
        "reflection": "Christ’s peace isn’t rented; it’s gifted. It remains when worldly calm evaporates.",
        "encouragement": "Receive peace like a hand on your shoulder — steady and kind."
      },
      "4": {
        "day_title": "Cast Your Cares",
        "verse_ref": "1 Peter 5:7 (NKJV)",
        "verse_text": "Casting all your care upon Him, for He cares for you.",
        "reflection": "Casting is active trust: you place what you can’t carry into hands that won’t drop you.",
        "encouragement": "Let go, not into nothing, but into Someone."
      },
      "5": {
        "day_title": "Still Waters",
        "verse_ref": "Psalm 23:2–3 (NKJV)",
        "verse_text": "He leads me beside the still waters. He restores my soul.",
        "reflection": "The Shepherd’s routes include restoration. Follow His lead to quiet places and renewed strength.",
        "encouragement": "Drink deeply; the waters are still because He is near."
      },
      "6": {
        "day_title": "Perfect Peace",
        "verse_ref": "Isaiah 26:3 (NKJV)",
        "verse_text": "You will keep him in perfect peace, whose mind is stayed on You, because he trusts in You.",
        "reflection": "Attention is devotion. Fixing your mind on Him steadies the heart He holds.",
        "encouragement": "Stay your mind; find your peace."
      },
      "7": {
        "day_title": "Be Still",
        "verse_ref": "Psalm 46:10 (NKJV)",
        "verse_text": "Be still, and know that I am God.",
        "reflection": "Stillness is not inactivity; it’s trust at rest. Knowing God calms the need to control.",
        "encouragement": "Release the reins; let God guide the team."
      }
    }
  },
  "4": {
    "week": 4,
    "title": "Love & Service",
    "days": {
      "1": {
        "day_title": "The Greatest is Love",
        "verse_ref": "1 Corinthians 13:13 (NKJV)",
        "verse_text": "And now abide faith, hope, love, these three; but the greatest of these is love.",
        "reflection": "Love crowns the virtues. Faith reaches and hope waits, but love serves.",
        "encouragement": "Lead with love; it never goes out of style."
      },
      "2": {
        "day_title": "Love in Action",
        "verse_ref": "1 John 3:18 (NKJV)",
        "verse_text": "Let us not love in word or in tongue, but in deed and in truth.",
        "reflection": "Love rolls up its sleeves. Let your hands agree with your heart today.",
        "encouragement": "Small deeds preach loud sermons."
      },
      "3": {
        "day_title": "Serve Like Jesus",
        "verse_ref": "Mark 10:45 (NKJV)",
        "verse_text": "For even the Son of Man did not come to be served, but to serve…",
        "reflection": "Greatness wears a towel. Serving is the family likeness of the children of God.",
        "encouragement": "Look for a towel, not a throne."
      },
      "4": {
        "day_title": "Walk in Love",
        "verse_ref": "Ephesians 5:2 (NKJV)",
        "verse_text": "And walk in love, as Christ also has loved us…",
        "reflection": "Love is a lifestyle, not a moment. Step after step, mirror the mercy you’ve received.",
        "encouragement": "Take love for a long walk today."
      },
      "5": {
        "day_title": "Encourage One Another",
        "verse_ref": "1 Thessalonians 5:11 (NKJV)",
        "verse_text": "Therefore comfort each other and edify one another…",
        "reflection": "Encouragement is faith’s carpentry — it builds up what life wears down.",
        "encouragement": "Say the good out loud; it strengthens the frame."
      },
      "6": {
        "day_title": "Do Good to All",
        "verse_ref": "Galatians 6:10 (NKJV)",
        "verse_text": "…let us do good to all, especially to those who are of the household of faith.",
        "reflection": "Goodness is a habit, not a headline. Practice kindness generously and locally.",
        "encouragement": "Start with one person within arm’s reach."
      },
      "7": {
        "day_title": "Let Love Be Without Hypocrisy",
        "verse_ref": "Romans 12:9–10 (NKJV)",
        "verse_text": "Let love be without hypocrisy… in honor giving preference to one another.",
        "reflection": "Sincere love prefers others. It is strong enough to be second.",
        "encouragement": "Choose the second chair; love sounds best in harmony."
      }
    }
  }
}

